TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.0.LTS *
       3                    ;* Date/Time created: Thu Mar 19 13:13:13 2020                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wifi/slne
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.0.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wifi/
      13                            .global SlNetIfConfigWifi

slnetifwifi.asm                                                      PAGE  132

    7203                            .dwattr $C$DW$664, DW_AT_decl_line(0x13a)
    7204                            .dwattr $C$DW$664, DW_AT_decl_column(0x05)
    7205                    
    7206                    $C$DW$665       .dwtag  DW_TAG_enumerator
    7207                            .dwattr $C$DW$665, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
    7208                            .dwattr $C$DW$665, DW_AT_const_value(0x04)
    7209                            .dwattr $C$DW$665, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetsock.h
    7210                            .dwattr $C$DW$665, DW_AT_decl_line(0x13b)
    7211                            .dwattr $C$DW$665, DW_AT_decl_column(0x05)
    7212                    
    7213                    $C$DW$666       .dwtag  DW_TAG_enumerator
    7214                            .dwattr $C$DW$666, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
    7215                            .dwattr $C$DW$666, DW_AT_const_value(0x05)
    7216                            .dwattr $C$DW$666, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetsock.h
    7217                            .dwattr $C$DW$666, DW_AT_decl_line(0x13c)
    7218                            .dwattr $C$DW$666, DW_AT_decl_column(0x05)
    7219                    
    7220                    $C$DW$667       .dwtag  DW_TAG_enumerator
    7221                            .dwattr $C$DW$667, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
    7222                            .dwattr $C$DW$667, DW_AT_const_value(0x06)
    7223                            .dwattr $C$DW$667, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetsock.h
    7224                            .dwattr $C$DW$667, DW_AT_decl_line(0x13d)
    7225                            .dwattr $C$DW$667, DW_AT_decl_column(0x05)
    7226                    
    7227                            .dwattr $C$DW$T$560, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetsock
    7228                            .dwattr $C$DW$T$560, DW_AT_decl_line(0x137)
    7229                            .dwattr $C$DW$T$560, DW_AT_decl_column(0x01)
    7230                            .dwendtag $C$DW$T$560
    7231                    
    7232                    $C$DW$T$561     .dwtag  DW_TAG_typedef
    7233                            .dwattr $C$DW$T$561, DW_AT_name("SlNetSockTxInhibitThreshold_e")
    7234                            .dwattr $C$DW$T$561, DW_AT_type(*$C$DW$T$560)
    7235                            .dwattr $C$DW$T$561, DW_AT_language(DW_LANG_C)
    7236                            .dwattr $C$DW$T$561, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetsock
    7237                            .dwattr $C$DW$T$561, DW_AT_decl_line(0x13e)
    7238                            .dwattr $C$DW$T$561, DW_AT_decl_column(0x03)
    7239                    
    7240                    
    7241                    $C$DW$T$562     .dwtag  DW_TAG_enumeration_type
    7242                            .dwattr $C$DW$T$562, DW_AT_byte_size(0x01)
    7243                    $C$DW$668       .dwtag  DW_TAG_enumerator
    7244                            .dwattr $C$DW$668, DW_AT_name("SLNETIF_STATE_DISABLE")
    7245                            .dwattr $C$DW$668, DW_AT_const_value(0x00)
    7246                            .dwattr $C$DW$668, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetif.h")
    7247                            .dwattr $C$DW$668, DW_AT_decl_line(0x62)
    7248                            .dwattr $C$DW$668, DW_AT_decl_column(0x05)
    7249                    
    7250                    $C$DW$669       .dwtag  DW_TAG_enumerator
    7251                            .dwattr $C$DW$669, DW_AT_name("SLNETIF_STATE_ENABLE")
    7252                            .dwattr $C$DW$669, DW_AT_const_value(0x01)
    7253                            .dwattr $C$DW$669, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetif.h")
    7254                            .dwattr $C$DW$669, DW_AT_decl_line(0x63)
    7255                            .dwattr $C$DW$669, DW_AT_decl_column(0x05)
    7256                    
    7257                            .dwattr $C$DW$T$562, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetif.h
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  133

    7258                            .dwattr $C$DW$T$562, DW_AT_decl_line(0x61)
    7259                            .dwattr $C$DW$T$562, DW_AT_decl_column(0x01)
    7260                            .dwendtag $C$DW$T$562
    7261                    
    7262                    $C$DW$T$563     .dwtag  DW_TAG_typedef
    7263                            .dwattr $C$DW$T$563, DW_AT_name("SlNetIfState_e")
    7264                            .dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$562)
    7265                            .dwattr $C$DW$T$563, DW_AT_language(DW_LANG_C)
    7266                            .dwattr $C$DW$T$563, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/net/slnetif.h
    7267                            .dwattr $C$DW$T$563, DW_AT_decl_line(0x64)
    7268                            .dwattr $C$DW$T$563, DW_AT_decl_column(0x03)
    7269                    
    7270                    
    7271                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7272                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x28)
    7273                    $C$DW$670       .dwtag  DW_TAG_member
    7274                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$6)
    7275                            .dwattr $C$DW$670, DW_AT_name("SsidLen")
    7276                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("SsidLen")
    7277                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7278                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7279                            .dwattr $C$DW$670, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7280                            .dwattr $C$DW$670, DW_AT_decl_line(0x243)
    7281                            .dwattr $C$DW$670, DW_AT_decl_column(0x0d)
    7282                    
    7283                    $C$DW$671       .dwtag  DW_TAG_member
    7284                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$23)
    7285                            .dwattr $C$DW$671, DW_AT_name("SsidName")
    7286                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("SsidName")
    7287                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7288                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7289                            .dwattr $C$DW$671, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7290                            .dwattr $C$DW$671, DW_AT_decl_line(0x244)
    7291                            .dwattr $C$DW$671, DW_AT_decl_column(0x0d)
    7292                    
    7293                    $C$DW$672       .dwtag  DW_TAG_member
    7294                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$24)
    7295                            .dwattr $C$DW$672, DW_AT_name("Bssid")
    7296                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("Bssid")
    7297                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7298                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7299                            .dwattr $C$DW$672, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7300                            .dwattr $C$DW$672, DW_AT_decl_line(0x245)
    7301                            .dwattr $C$DW$672, DW_AT_decl_column(0x0d)
    7302                    
    7303                    $C$DW$673       .dwtag  DW_TAG_member
    7304                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$6)
    7305                            .dwattr $C$DW$673, DW_AT_name("Padding")
    7306                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("Padding")
    7307                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7308                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7309                            .dwattr $C$DW$673, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7310                            .dwattr $C$DW$673, DW_AT_decl_line(0x246)
    7311                            .dwattr $C$DW$673, DW_AT_decl_column(0x0d)
    7312                    
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  134

    7313                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7314                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x242)
    7315                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    7316                            .dwendtag $C$DW$T$25
    7317                    
    7318                    $C$DW$T$243     .dwtag  DW_TAG_typedef
    7319                            .dwattr $C$DW$T$243, DW_AT_name("SlWlanEventConnect_t")
    7320                            .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$25)
    7321                            .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    7322                            .dwattr $C$DW$T$243, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7323                            .dwattr $C$DW$T$243, DW_AT_decl_line(0x247)
    7324                            .dwattr $C$DW$T$243, DW_AT_decl_column(0x03)
    7325                    
    7326                    
    7327                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7328                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x4c)
    7329                    $C$DW$674       .dwtag  DW_TAG_member
    7330                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$6)
    7331                            .dwattr $C$DW$674, DW_AT_name("SsidLen")
    7332                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("SsidLen")
    7333                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7334                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7335                            .dwattr $C$DW$674, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7336                            .dwattr $C$DW$674, DW_AT_decl_line(0x25a)
    7337                            .dwattr $C$DW$674, DW_AT_decl_column(0x0d)
    7338                    
    7339                    $C$DW$675       .dwtag  DW_TAG_member
    7340                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    7341                            .dwattr $C$DW$675, DW_AT_name("SsidName")
    7342                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("SsidName")
    7343                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7344                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7345                            .dwattr $C$DW$675, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7346                            .dwattr $C$DW$675, DW_AT_decl_line(0x25b)
    7347                            .dwattr $C$DW$675, DW_AT_decl_column(0x0d)
    7348                    
    7349                    $C$DW$676       .dwtag  DW_TAG_member
    7350                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$24)
    7351                            .dwattr $C$DW$676, DW_AT_name("Bssid")
    7352                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("Bssid")
    7353                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7354                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7355                            .dwattr $C$DW$676, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7356                            .dwattr $C$DW$676, DW_AT_decl_line(0x25c)
    7357                            .dwattr $C$DW$676, DW_AT_decl_column(0x0d)
    7358                    
    7359                    $C$DW$677       .dwtag  DW_TAG_member
    7360                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$6)
    7361                            .dwattr $C$DW$677, DW_AT_name("Reserved")
    7362                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("Reserved")
    7363                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7364                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7365                            .dwattr $C$DW$677, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7366                            .dwattr $C$DW$677, DW_AT_decl_line(0x25d)
    7367                            .dwattr $C$DW$677, DW_AT_decl_column(0x0d)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  135

    7368                    
    7369                    $C$DW$678       .dwtag  DW_TAG_member
    7370                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$6)
    7371                            .dwattr $C$DW$678, DW_AT_name("GoDeviceNameLen")
    7372                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("GoDeviceNameLen")
    7373                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7374                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7375                            .dwattr $C$DW$678, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7376                            .dwattr $C$DW$678, DW_AT_decl_line(0x25e)
    7377                            .dwattr $C$DW$678, DW_AT_decl_column(0x0d)
    7378                    
    7379                    $C$DW$679       .dwtag  DW_TAG_member
    7380                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    7381                            .dwattr $C$DW$679, DW_AT_name("GoDeviceName")
    7382                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("GoDeviceName")
    7383                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    7384                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7385                            .dwattr $C$DW$679, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7386                            .dwattr $C$DW$679, DW_AT_decl_line(0x25f)
    7387                            .dwattr $C$DW$679, DW_AT_decl_column(0x0d)
    7388                    
    7389                    $C$DW$680       .dwtag  DW_TAG_member
    7390                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$26)
    7391                            .dwattr $C$DW$680, DW_AT_name("Padding")
    7392                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("Padding")
    7393                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    7394                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7395                            .dwattr $C$DW$680, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7396                            .dwattr $C$DW$680, DW_AT_decl_line(0x260)
    7397                            .dwattr $C$DW$680, DW_AT_decl_column(0x0d)
    7398                    
    7399                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7400                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x259)
    7401                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    7402                            .dwendtag $C$DW$T$27
    7403                    
    7404                    $C$DW$T$244     .dwtag  DW_TAG_typedef
    7405                            .dwattr $C$DW$T$244, DW_AT_name("SlWlanEventP2PConnect_t")
    7406                            .dwattr $C$DW$T$244, DW_AT_type(*$C$DW$T$27)
    7407                            .dwattr $C$DW$T$244, DW_AT_language(DW_LANG_C)
    7408                            .dwattr $C$DW$T$244, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7409                            .dwattr $C$DW$T$244, DW_AT_decl_line(0x261)
    7410                            .dwattr $C$DW$T$244, DW_AT_decl_column(0x03)
    7411                    
    7412                    
    7413                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7414                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x50)
    7415                    $C$DW$681       .dwtag  DW_TAG_member
    7416                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$6)
    7417                            .dwattr $C$DW$681, DW_AT_name("Mode")
    7418                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("Mode")
    7419                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7420                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7421                            .dwattr $C$DW$681, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7422                            .dwattr $C$DW$681, DW_AT_decl_line(0x30f)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  136

    7423                            .dwattr $C$DW$681, DW_AT_decl_column(0x09)
    7424                    
    7425                    $C$DW$682       .dwtag  DW_TAG_member
    7426                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$6)
    7427                            .dwattr $C$DW$682, DW_AT_name("ConnStatus")
    7428                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("ConnStatus")
    7429                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7430                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7431                            .dwattr $C$DW$682, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7432                            .dwattr $C$DW$682, DW_AT_decl_line(0x310)
    7433                            .dwattr $C$DW$682, DW_AT_decl_column(0x09)
    7434                    
    7435                    $C$DW$683       .dwtag  DW_TAG_member
    7436                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$6)
    7437                            .dwattr $C$DW$683, DW_AT_name("SecType")
    7438                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("SecType")
    7439                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7440                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7441                            .dwattr $C$DW$683, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7442                            .dwattr $C$DW$683, DW_AT_decl_line(0x311)
    7443                            .dwattr $C$DW$683, DW_AT_decl_column(0x09)
    7444                    
    7445                    $C$DW$684       .dwtag  DW_TAG_member
    7446                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$6)
    7447                            .dwattr $C$DW$684, DW_AT_name("Reserved")
    7448                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("Reserved")
    7449                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7450                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7451                            .dwattr $C$DW$684, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7452                            .dwattr $C$DW$684, DW_AT_decl_line(0x312)
    7453                            .dwattr $C$DW$684, DW_AT_decl_column(0x09)
    7454                    
    7455                    $C$DW$685       .dwtag  DW_TAG_member
    7456                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$28)
    7457                            .dwattr $C$DW$685, DW_AT_name("ConnectionInfo")
    7458                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("ConnectionInfo")
    7459                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7460                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7461                            .dwattr $C$DW$685, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7462                            .dwattr $C$DW$685, DW_AT_decl_line(0x313)
    7463                            .dwattr $C$DW$685, DW_AT_decl_column(0x1c)
    7464                    
    7465                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7466                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x30e)
    7467                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    7468                            .dwendtag $C$DW$T$29
    7469                    
    7470                    $C$DW$T$564     .dwtag  DW_TAG_typedef
    7471                            .dwattr $C$DW$T$564, DW_AT_name("SlWlanConnStatusParam_t")
    7472                            .dwattr $C$DW$T$564, DW_AT_type(*$C$DW$T$29)
    7473                            .dwattr $C$DW$T$564, DW_AT_language(DW_LANG_C)
    7474                            .dwattr $C$DW$T$564, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7475                            .dwattr $C$DW$T$564, DW_AT_decl_line(0x314)
    7476                            .dwattr $C$DW$T$564, DW_AT_decl_column(0x02)
    7477                    
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  137

    7478                    
    7479                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7480                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    7481                    $C$DW$686       .dwtag  DW_TAG_member
    7482                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$14)
    7483                            .dwattr $C$DW$686, DW_AT_name("__max_align1")
    7484                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("__max_align1")
    7485                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7486                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7487                            .dwattr $C$DW$686, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7488                            .dwattr $C$DW$686, DW_AT_decl_line(0x7b)
    7489                            .dwattr $C$DW$686, DW_AT_decl_column(0x0c)
    7490                    
    7491                    $C$DW$687       .dwtag  DW_TAG_member
    7492                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$18)
    7493                            .dwattr $C$DW$687, DW_AT_name("__max_align2")
    7494                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("__max_align2")
    7495                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7496                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7497                            .dwattr $C$DW$687, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7498                            .dwattr $C$DW$687, DW_AT_decl_line(0x7c)
    7499                            .dwattr $C$DW$687, DW_AT_decl_column(0x0e)
    7500                    
    7501                            .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.L
    7502                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x7a)
    7503                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    7504                            .dwendtag $C$DW$T$30
    7505                    
    7506                    $C$DW$T$566     .dwtag  DW_TAG_typedef
    7507                            .dwattr $C$DW$T$566, DW_AT_name("__max_align_t")
    7508                            .dwattr $C$DW$T$566, DW_AT_type(*$C$DW$T$30)
    7509                            .dwattr $C$DW$T$566, DW_AT_language(DW_LANG_C)
    7510                            .dwattr $C$DW$T$566, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.
    7511                            .dwattr $C$DW$T$566, DW_AT_decl_line(0x7d)
    7512                            .dwattr $C$DW$T$566, DW_AT_decl_column(0x03)
    7513                    
    7514                    
    7515                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7516                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x08)
    7517                    $C$DW$688       .dwtag  DW_TAG_member
    7518                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$32)
    7519                            .dwattr $C$DW$688, DW_AT_name("hi")
    7520                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("hi")
    7521                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7522                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7523                            .dwattr $C$DW$688, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/Clo
    7524                            .dwattr $C$DW$688, DW_AT_decl_line(0x5c)
    7525                            .dwattr $C$DW$688, DW_AT_decl_column(0x0e)
    7526                    
    7527                    $C$DW$689       .dwtag  DW_TAG_member
    7528                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    7529                            .dwattr $C$DW$689, DW_AT_name("lo")
    7530                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("lo")
    7531                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7532                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  138

    7533                            .dwattr $C$DW$689, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/Clo
    7534                            .dwattr $C$DW$689, DW_AT_decl_line(0x5d)
    7535                            .dwattr $C$DW$689, DW_AT_decl_column(0x0e)
    7536                    
    7537                            .dwattr $C$DW$T$33, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/Cl
    7538                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x5b)
    7539                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    7540                            .dwendtag $C$DW$T$33
    7541                    
    7542                    $C$DW$T$567     .dwtag  DW_TAG_typedef
    7543                            .dwattr $C$DW$T$567, DW_AT_name("ClockP_FreqHz")
    7544                            .dwattr $C$DW$T$567, DW_AT_type(*$C$DW$T$33)
    7545                            .dwattr $C$DW$T$567, DW_AT_language(DW_LANG_C)
    7546                            .dwattr $C$DW$T$567, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/C
    7547                            .dwattr $C$DW$T$567, DW_AT_decl_line(0x5e)
    7548                            .dwattr $C$DW$T$567, DW_AT_decl_column(0x03)
    7549                    
    7550                    
    7551                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7552                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    7553                    $C$DW$690       .dwtag  DW_TAG_member
    7554                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$34)
    7555                            .dwattr $C$DW$690, DW_AT_name("startFlag")
    7556                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("startFlag")
    7557                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7558                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7559                            .dwattr $C$DW$690, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/Clo
    7560                            .dwattr $C$DW$690, DW_AT_decl_line(0x8b)
    7561                            .dwattr $C$DW$690, DW_AT_decl_column(0x0f)
    7562                    
    7563                    $C$DW$691       .dwtag  DW_TAG_member
    7564                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$32)
    7565                            .dwattr $C$DW$691, DW_AT_name("period")
    7566                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("period")
    7567                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7568                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7569                            .dwattr $C$DW$691, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/Clo
    7570                            .dwattr $C$DW$691, DW_AT_decl_line(0x8c)
    7571                            .dwattr $C$DW$691, DW_AT_decl_column(0x0f)
    7572                    
    7573                    $C$DW$692       .dwtag  DW_TAG_member
    7574                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$36)
    7575                            .dwattr $C$DW$692, DW_AT_name("arg")
    7576                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("arg")
    7577                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7578                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7579                            .dwattr $C$DW$692, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/Clo
    7580                            .dwattr $C$DW$692, DW_AT_decl_line(0x8d)
    7581                            .dwattr $C$DW$692, DW_AT_decl_column(0x0f)
    7582                    
    7583                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/Cl
    7584                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x8a)
    7585                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    7586                            .dwendtag $C$DW$T$37
    7587                    
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  139

    7588                    $C$DW$T$568     .dwtag  DW_TAG_typedef
    7589                            .dwattr $C$DW$T$568, DW_AT_name("ClockP_Params")
    7590                            .dwattr $C$DW$T$568, DW_AT_type(*$C$DW$T$37)
    7591                            .dwattr $C$DW$T$568, DW_AT_language(DW_LANG_C)
    7592                            .dwattr $C$DW$T$568, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/dpl/C
    7593                            .dwattr $C$DW$T$568, DW_AT_decl_line(0x8e)
    7594                            .dwattr $C$DW$T$568, DW_AT_decl_column(0x03)
    7595                    
    7596                    
    7597                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7598                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    7599                    $C$DW$693       .dwtag  DW_TAG_member
    7600                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$8)
    7601                            .dwattr $C$DW$693, DW_AT_name("daylight")
    7602                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("daylight")
    7603                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7604                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7605                            .dwattr $C$DW$693, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7606                            .dwattr $C$DW$693, DW_AT_decl_line(0x9b)
    7607                            .dwattr $C$DW$693, DW_AT_decl_column(0x0b)
    7608                    
    7609                    $C$DW$694       .dwtag  DW_TAG_member
    7610                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$12)
    7611                            .dwattr $C$DW$694, DW_AT_name("timezone")
    7612                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("timezone")
    7613                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7614                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7615                            .dwattr $C$DW$694, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7616                            .dwattr $C$DW$694, DW_AT_decl_line(0x9c)
    7617                            .dwattr $C$DW$694, DW_AT_decl_column(0x0b)
    7618                    
    7619                    $C$DW$695       .dwtag  DW_TAG_member
    7620                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$39)
    7621                            .dwattr $C$DW$695, DW_AT_name("tzname")
    7622                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("tzname")
    7623                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7624                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7625                            .dwattr $C$DW$695, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7626                            .dwattr $C$DW$695, DW_AT_decl_line(0x9d)
    7627                            .dwattr $C$DW$695, DW_AT_decl_column(0x0b)
    7628                    
    7629                    $C$DW$696       .dwtag  DW_TAG_member
    7630                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$39)
    7631                            .dwattr $C$DW$696, DW_AT_name("dstname")
    7632                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("dstname")
    7633                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7634                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7635                            .dwattr $C$DW$696, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7636                            .dwattr $C$DW$696, DW_AT_decl_line(0x9e)
    7637                            .dwattr $C$DW$696, DW_AT_decl_column(0x0b)
    7638                    
    7639                            .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.L
    7640                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x9a)
    7641                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    7642                            .dwendtag $C$DW$T$40
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  140

    7643                    
    7644                    $C$DW$T$569     .dwtag  DW_TAG_typedef
    7645                            .dwattr $C$DW$T$569, DW_AT_name("TZ")
    7646                            .dwattr $C$DW$T$569, DW_AT_type(*$C$DW$T$40)
    7647                            .dwattr $C$DW$T$569, DW_AT_language(DW_LANG_C)
    7648                            .dwattr $C$DW$T$569, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.
    7649                            .dwattr $C$DW$T$569, DW_AT_decl_line(0x9f)
    7650                            .dwattr $C$DW$T$569, DW_AT_decl_column(0x03)
    7651                    
    7652                    
    7653                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7654                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    7655                    $C$DW$697       .dwtag  DW_TAG_member
    7656                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$43)
    7657                            .dwattr $C$DW$697, DW_AT_name("pEntry")
    7658                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("pEntry")
    7659                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7660                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7661                            .dwattr $C$DW$697, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7662                            .dwattr $C$DW$697, DW_AT_decl_line(0x80)
    7663                            .dwattr $C$DW$697, DW_AT_decl_column(0x16)
    7664                    
    7665                    $C$DW$698       .dwtag  DW_TAG_member
    7666                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$3)
    7667                            .dwattr $C$DW$698, DW_AT_name("pValue")
    7668                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("pValue")
    7669                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7670                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7671                            .dwattr $C$DW$698, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7672                            .dwattr $C$DW$698, DW_AT_decl_line(0x81)
    7673                            .dwattr $C$DW$698, DW_AT_decl_column(0x0b)
    7674                    
    7675                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7676                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x7f)
    7677                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    7678                            .dwendtag $C$DW$T$44
    7679                    
    7680                    $C$DW$T$570     .dwtag  DW_TAG_typedef
    7681                            .dwattr $C$DW$T$570, DW_AT_name("tSimpleLinkSpawnMsg")
    7682                            .dwattr $C$DW$T$570, DW_AT_type(*$C$DW$T$44)
    7683                            .dwattr $C$DW$T$570, DW_AT_language(DW_LANG_C)
    7684                            .dwattr $C$DW$T$570, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7685                            .dwattr $C$DW$T$570, DW_AT_decl_line(0x82)
    7686                            .dwattr $C$DW$T$570, DW_AT_decl_column(0x02)
    7687                    
    7688                    
    7689                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7690                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
    7691                    $C$DW$699       .dwtag  DW_TAG_member
    7692                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$10)
    7693                            .dwattr $C$DW$699, DW_AT_name("quot")
    7694                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("quot")
    7695                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7696                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7697                            .dwattr $C$DW$699, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  141

    7698                            .dwattr $C$DW$699, DW_AT_decl_line(0x4e)
    7699                            .dwattr $C$DW$699, DW_AT_decl_column(0x16)
    7700                    
    7701                    $C$DW$700       .dwtag  DW_TAG_member
    7702                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$10)
    7703                            .dwattr $C$DW$700, DW_AT_name("rem")
    7704                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("rem")
    7705                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7706                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7707                            .dwattr $C$DW$700, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7708                            .dwattr $C$DW$700, DW_AT_decl_line(0x4e)
    7709                            .dwattr $C$DW$700, DW_AT_decl_column(0x1c)
    7710                    
    7711                            .dwattr $C$DW$T$45, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.L
    7712                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x4e)
    7713                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    7714                            .dwendtag $C$DW$T$45
    7715                    
    7716                    $C$DW$T$571     .dwtag  DW_TAG_typedef
    7717                            .dwattr $C$DW$T$571, DW_AT_name("div_t")
    7718                            .dwattr $C$DW$T$571, DW_AT_type(*$C$DW$T$45)
    7719                            .dwattr $C$DW$T$571, DW_AT_language(DW_LANG_C)
    7720                            .dwattr $C$DW$T$571, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.
    7721                            .dwattr $C$DW$T$571, DW_AT_decl_line(0x4e)
    7722                            .dwattr $C$DW$T$571, DW_AT_decl_column(0x23)
    7723                    
    7724                    
    7725                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7726                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x08)
    7727                    $C$DW$701       .dwtag  DW_TAG_member
    7728                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$10)
    7729                            .dwattr $C$DW$701, DW_AT_name("quot")
    7730                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("quot")
    7731                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7732                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7733                            .dwattr $C$DW$701, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7734                            .dwattr $C$DW$701, DW_AT_decl_line(0x53)
    7735                            .dwattr $C$DW$701, DW_AT_decl_column(0x16)
    7736                    
    7737                    $C$DW$702       .dwtag  DW_TAG_member
    7738                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$10)
    7739                            .dwattr $C$DW$702, DW_AT_name("rem")
    7740                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("rem")
    7741                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7742                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7743                            .dwattr $C$DW$702, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7744                            .dwattr $C$DW$702, DW_AT_decl_line(0x53)
    7745                            .dwattr $C$DW$702, DW_AT_decl_column(0x1c)
    7746                    
    7747                            .dwattr $C$DW$T$46, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.L
    7748                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x53)
    7749                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    7750                            .dwendtag $C$DW$T$46
    7751                    
    7752                    $C$DW$T$572     .dwtag  DW_TAG_typedef
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  142

    7753                            .dwattr $C$DW$T$572, DW_AT_name("ldiv_t")
    7754                            .dwattr $C$DW$T$572, DW_AT_type(*$C$DW$T$46)
    7755                            .dwattr $C$DW$T$572, DW_AT_language(DW_LANG_C)
    7756                            .dwattr $C$DW$T$572, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.
    7757                            .dwattr $C$DW$T$572, DW_AT_decl_line(0x53)
    7758                            .dwattr $C$DW$T$572, DW_AT_decl_column(0x23)
    7759                    
    7760                    
    7761                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    7762                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    7763                    $C$DW$703       .dwtag  DW_TAG_member
    7764                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$14)
    7765                            .dwattr $C$DW$703, DW_AT_name("quot")
    7766                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("quot")
    7767                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7768                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7769                            .dwattr $C$DW$703, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7770                            .dwattr $C$DW$703, DW_AT_decl_line(0x5b)
    7771                            .dwattr $C$DW$703, DW_AT_decl_column(0x1c)
    7772                    
    7773                    $C$DW$704       .dwtag  DW_TAG_member
    7774                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$14)
    7775                            .dwattr $C$DW$704, DW_AT_name("rem")
    7776                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("rem")
    7777                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7778                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7779                            .dwattr $C$DW$704, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.LT
    7780                            .dwattr $C$DW$704, DW_AT_decl_line(0x5b)
    7781                            .dwattr $C$DW$704, DW_AT_decl_column(0x22)
    7782                    
    7783                            .dwattr $C$DW$T$47, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.L
    7784                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x5b)
    7785                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    7786                            .dwendtag $C$DW$T$47
    7787                    
    7788                    $C$DW$T$573     .dwtag  DW_TAG_typedef
    7789                            .dwattr $C$DW$T$573, DW_AT_name("lldiv_t")
    7790                            .dwattr $C$DW$T$573, DW_AT_type(*$C$DW$T$47)
    7791                            .dwattr $C$DW$T$573, DW_AT_language(DW_LANG_C)
    7792                            .dwattr $C$DW$T$573, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.0.
    7793                            .dwattr $C$DW$T$573, DW_AT_decl_line(0x5b)
    7794                            .dwattr $C$DW$T$573, DW_AT_decl_column(0x29)
    7795                    
    7796                    
    7797                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    7798                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x24)
    7799                    $C$DW$705       .dwtag  DW_TAG_member
    7800                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$9)
    7801                            .dwattr $C$DW$705, DW_AT_name("Flags")
    7802                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("Flags")
    7803                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7804                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7805                            .dwattr $C$DW$705, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7806                            .dwattr $C$DW$705, DW_AT_decl_line(0x90)
    7807                            .dwattr $C$DW$705, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  143

    7808                    
    7809                    $C$DW$706       .dwtag  DW_TAG_member
    7810                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$13)
    7811                            .dwattr $C$DW$706, DW_AT_name("Len")
    7812                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("Len")
    7813                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7814                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7815                            .dwattr $C$DW$706, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7816                            .dwattr $C$DW$706, DW_AT_decl_line(0x91)
    7817                            .dwattr $C$DW$706, DW_AT_decl_column(0x0b)
    7818                    
    7819                    $C$DW$707       .dwtag  DW_TAG_member
    7820                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$13)
    7821                            .dwattr $C$DW$707, DW_AT_name("MaxSize")
    7822                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("MaxSize")
    7823                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7824                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7825                            .dwattr $C$DW$707, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7826                            .dwattr $C$DW$707, DW_AT_decl_line(0x92)
    7827                            .dwattr $C$DW$707, DW_AT_decl_column(0x0b)
    7828                    
    7829                    $C$DW$708       .dwtag  DW_TAG_member
    7830                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$48)
    7831                            .dwattr $C$DW$708, DW_AT_name("Token")
    7832                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("Token")
    7833                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7834                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7835                            .dwattr $C$DW$708, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7836                            .dwattr $C$DW$708, DW_AT_decl_line(0x93)
    7837                            .dwattr $C$DW$708, DW_AT_decl_column(0x0b)
    7838                    
    7839                    $C$DW$709       .dwtag  DW_TAG_member
    7840                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$13)
    7841                            .dwattr $C$DW$709, DW_AT_name("StorageSize")
    7842                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("StorageSize")
    7843                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7844                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7845                            .dwattr $C$DW$709, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7846                            .dwattr $C$DW$709, DW_AT_decl_line(0x94)
    7847                            .dwattr $C$DW$709, DW_AT_decl_column(0x0b)
    7848                    
    7849                    $C$DW$710       .dwtag  DW_TAG_member
    7850                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$13)
    7851                            .dwattr $C$DW$710, DW_AT_name("WriteCounter")
    7852                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("WriteCounter")
    7853                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7854                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7855                            .dwattr $C$DW$710, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7856                            .dwattr $C$DW$710, DW_AT_decl_line(0x95)
    7857                            .dwattr $C$DW$710, DW_AT_decl_column(0x0b)
    7858                    
    7859                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7860                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x8f)
    7861                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    7862                            .dwendtag $C$DW$T$49
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  144

    7863                    
    7864                    $C$DW$T$574     .dwtag  DW_TAG_typedef
    7865                            .dwattr $C$DW$T$574, DW_AT_name("SlFsFileInfo_t")
    7866                            .dwattr $C$DW$T$574, DW_AT_type(*$C$DW$T$49)
    7867                            .dwattr $C$DW$T$574, DW_AT_language(DW_LANG_C)
    7868                            .dwattr $C$DW$T$574, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7869                            .dwattr $C$DW$T$574, DW_AT_decl_line(0x96)
    7870                            .dwattr $C$DW$T$574, DW_AT_decl_column(0x02)
    7871                    
    7872                    
    7873                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7874                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
    7875                    $C$DW$711       .dwtag  DW_TAG_member
    7876                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$48)
    7877                            .dwattr $C$DW$711, DW_AT_name("Key")
    7878                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("Key")
    7879                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7880                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7881                            .dwattr $C$DW$711, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7882                            .dwattr $C$DW$711, DW_AT_decl_line(0xb1)
    7883                            .dwattr $C$DW$711, DW_AT_decl_column(0x0b)
    7884                    
    7885                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7886                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xb0)
    7887                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    7888                            .dwendtag $C$DW$T$50
    7889                    
    7890                    $C$DW$T$575     .dwtag  DW_TAG_typedef
    7891                            .dwattr $C$DW$T$575, DW_AT_name("SlFsKey_t")
    7892                            .dwattr $C$DW$T$575, DW_AT_type(*$C$DW$T$50)
    7893                            .dwattr $C$DW$T$575, DW_AT_language(DW_LANG_C)
    7894                            .dwattr $C$DW$T$575, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7895                            .dwattr $C$DW$T$575, DW_AT_decl_line(0xb2)
    7896                            .dwattr $C$DW$T$575, DW_AT_decl_column(0x02)
    7897                    
    7898                    
    7899                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    7900                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    7901                    $C$DW$712       .dwtag  DW_TAG_member
    7902                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$6)
    7903                            .dwattr $C$DW$712, DW_AT_name("Index")
    7904                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("Index")
    7905                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7906                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7907                            .dwattr $C$DW$712, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7908                            .dwattr $C$DW$712, DW_AT_decl_line(0xb6)
    7909                            .dwattr $C$DW$712, DW_AT_decl_column(0x09)
    7910                    
    7911                            .dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7912                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xb5)
    7913                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    7914                            .dwendtag $C$DW$T$51
    7915                    
    7916                    $C$DW$T$251     .dwtag  DW_TAG_typedef
    7917                            .dwattr $C$DW$T$251, DW_AT_name("SlFsFileNameIndex_t")
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  145

    7918                            .dwattr $C$DW$T$251, DW_AT_type(*$C$DW$T$51)
    7919                            .dwattr $C$DW$T$251, DW_AT_language(DW_LANG_C)
    7920                            .dwattr $C$DW$T$251, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7921                            .dwattr $C$DW$T$251, DW_AT_decl_line(0xb7)
    7922                            .dwattr $C$DW$T$251, DW_AT_decl_column(0x02)
    7923                    
    7924                    
    7925                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    7926                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    7927                    $C$DW$713       .dwtag  DW_TAG_member
    7928                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$13)
    7929                            .dwattr $C$DW$713, DW_AT_name("Operation")
    7930                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("Operation")
    7931                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7932                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7933                            .dwattr $C$DW$713, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7934                            .dwattr $C$DW$713, DW_AT_decl_line(0xca)
    7935                            .dwattr $C$DW$713, DW_AT_decl_column(0x08)
    7936                    
    7937                            .dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7938                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xc9)
    7939                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    7940                            .dwendtag $C$DW$T$52
    7941                    
    7942                    $C$DW$T$576     .dwtag  DW_TAG_typedef
    7943                            .dwattr $C$DW$T$576, DW_AT_name("SlFsRetToFactoryCommand_t")
    7944                            .dwattr $C$DW$T$576, DW_AT_type(*$C$DW$T$52)
    7945                            .dwattr $C$DW$T$576, DW_AT_language(DW_LANG_C)
    7946                            .dwattr $C$DW$T$576, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    7947                            .dwattr $C$DW$T$576, DW_AT_decl_line(0xcb)
    7948                            .dwattr $C$DW$T$576, DW_AT_decl_column(0x02)
    7949                    
    7950                    
    7951                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    7952                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    7953                    $C$DW$714       .dwtag  DW_TAG_member
    7954                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$13)
    7955                            .dwattr $C$DW$714, DW_AT_name("IncludeFilters")
    7956                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("IncludeFilters")
    7957                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7958                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7959                            .dwattr $C$DW$714, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7960                            .dwattr $C$DW$714, DW_AT_decl_line(0xd1)
    7961                            .dwattr $C$DW$714, DW_AT_decl_column(0x12)
    7962                    
    7963                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    7964                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xd0)
    7965                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    7966                            .dwendtag $C$DW$T$53
    7967                    
    7968                    $C$DW$T$577     .dwtag  DW_TAG_typedef
    7969                            .dwattr $C$DW$T$577, DW_AT_name("SlFsControl_t")
    7970                            .dwattr $C$DW$T$577, DW_AT_type(*$C$DW$T$53)
    7971                            .dwattr $C$DW$T$577, DW_AT_language(DW_LANG_C)
    7972                            .dwattr $C$DW$T$577, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  146

    7973                            .dwattr $C$DW$T$577, DW_AT_decl_line(0xd3)
    7974                            .dwattr $C$DW$T$577, DW_AT_decl_column(0x02)
    7975                    
    7976                    
    7977                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    7978                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    7979                    $C$DW$715       .dwtag  DW_TAG_member
    7980                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$9)
    7981                            .dwattr $C$DW$715, DW_AT_name("DeviceBlockSize")
    7982                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("DeviceBlockSize")
    7983                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7984                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7985                            .dwattr $C$DW$715, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7986                            .dwattr $C$DW$715, DW_AT_decl_line(0xd7)
    7987                            .dwattr $C$DW$715, DW_AT_decl_column(0x08)
    7988                    
    7989                    $C$DW$716       .dwtag  DW_TAG_member
    7990                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$9)
    7991                            .dwattr $C$DW$716, DW_AT_name("DeviceBlocksCapacity")
    7992                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    7993                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7994                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7995                            .dwattr $C$DW$716, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    7996                            .dwattr $C$DW$716, DW_AT_decl_line(0xd8)
    7997                            .dwattr $C$DW$716, DW_AT_decl_column(0x08)
    7998                    
    7999                    $C$DW$717       .dwtag  DW_TAG_member
    8000                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$9)
    8001                            .dwattr $C$DW$717, DW_AT_name("NumOfAllocatedBlocks")
    8002                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    8003                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8004                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8005                            .dwattr $C$DW$717, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8006                            .dwattr $C$DW$717, DW_AT_decl_line(0xd9)
    8007                            .dwattr $C$DW$717, DW_AT_decl_column(0x08)
    8008                    
    8009                    $C$DW$718       .dwtag  DW_TAG_member
    8010                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$9)
    8011                            .dwattr $C$DW$718, DW_AT_name("NumOfReservedBlocks")
    8012                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("NumOfReservedBlocks")
    8013                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8014                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8015                            .dwattr $C$DW$718, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8016                            .dwattr $C$DW$718, DW_AT_decl_line(0xda)
    8017                            .dwattr $C$DW$718, DW_AT_decl_column(0x08)
    8018                    
    8019                    $C$DW$719       .dwtag  DW_TAG_member
    8020                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$9)
    8021                            .dwattr $C$DW$719, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    8022                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
    8023                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8024                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8025                            .dwattr $C$DW$719, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8026                            .dwattr $C$DW$719, DW_AT_decl_line(0xdb)
    8027                            .dwattr $C$DW$719, DW_AT_decl_column(0x08)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  147

    8028                    
    8029                    $C$DW$720       .dwtag  DW_TAG_member
    8030                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$9)
    8031                            .dwattr $C$DW$720, DW_AT_name("LargestAllocatedGapInBlocks")
    8032                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    8033                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8034                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8035                            .dwattr $C$DW$720, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8036                            .dwattr $C$DW$720, DW_AT_decl_line(0xdc)
    8037                            .dwattr $C$DW$720, DW_AT_decl_column(0x08)
    8038                    
    8039                    $C$DW$721       .dwtag  DW_TAG_member
    8040                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$9)
    8041                            .dwattr $C$DW$721, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    8042                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    8043                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8044                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8045                            .dwattr $C$DW$721, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8046                            .dwattr $C$DW$721, DW_AT_decl_line(0xdd)
    8047                            .dwattr $C$DW$721, DW_AT_decl_column(0x08)
    8048                    
    8049                    $C$DW$722       .dwtag  DW_TAG_member
    8050                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$54)
    8051                            .dwattr $C$DW$722, DW_AT_name("Padding")
    8052                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("Padding")
    8053                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8054                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8055                            .dwattr $C$DW$722, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8056                            .dwattr $C$DW$722, DW_AT_decl_line(0xde)
    8057                            .dwattr $C$DW$722, DW_AT_decl_column(0x08)
    8058                    
    8059                            .dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    8060                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xd6)
    8061                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    8062                            .dwendtag $C$DW$T$55
    8063                    
    8064                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    8065                            .dwattr $C$DW$T$57, DW_AT_name("SlFsControlDeviceUsage_t")
    8066                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$55)
    8067                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    8068                            .dwattr $C$DW$T$57, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    8069                            .dwattr $C$DW$T$57, DW_AT_decl_line(0xdf)
    8070                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    8071                    
    8072                    
    8073                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    8074                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x14)
    8075                    $C$DW$723       .dwtag  DW_TAG_member
    8076                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$6)
    8077                            .dwattr $C$DW$723, DW_AT_name("MaxFsFiles")
    8078                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("MaxFsFiles")
    8079                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8080                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8081                            .dwattr $C$DW$723, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8082                            .dwattr $C$DW$723, DW_AT_decl_line(0xe3)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  148

    8083                            .dwattr $C$DW$723, DW_AT_decl_column(0x08)
    8084                    
    8085                    $C$DW$724       .dwtag  DW_TAG_member
    8086                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$6)
    8087                            .dwattr $C$DW$724, DW_AT_name("IsDevlopmentFormatType")
    8088                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    8089                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8090                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8091                            .dwattr $C$DW$724, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8092                            .dwattr $C$DW$724, DW_AT_decl_line(0xe4)
    8093                            .dwattr $C$DW$724, DW_AT_decl_column(0x08)
    8094                    
    8095                    $C$DW$725       .dwtag  DW_TAG_member
    8096                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$6)
    8097                            .dwattr $C$DW$725, DW_AT_name("Bundlestate")
    8098                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("Bundlestate")
    8099                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8100                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8101                            .dwattr $C$DW$725, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8102                            .dwattr $C$DW$725, DW_AT_decl_line(0xe5)
    8103                            .dwattr $C$DW$725, DW_AT_decl_column(0x08)
    8104                    
    8105                    $C$DW$726       .dwtag  DW_TAG_member
    8106                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$6)
    8107                            .dwattr $C$DW$726, DW_AT_name("Reserved")
    8108                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("Reserved")
    8109                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8110                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8111                            .dwattr $C$DW$726, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8112                            .dwattr $C$DW$726, DW_AT_decl_line(0xe6)
    8113                            .dwattr $C$DW$726, DW_AT_decl_column(0x08)
    8114                    
    8115                    $C$DW$727       .dwtag  DW_TAG_member
    8116                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$6)
    8117                            .dwattr $C$DW$727, DW_AT_name("MaxFsFilesReservedForSysFiles")
    8118                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    8119                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8120                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8121                            .dwattr $C$DW$727, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8122                            .dwattr $C$DW$727, DW_AT_decl_line(0xe7)
    8123                            .dwattr $C$DW$727, DW_AT_decl_column(0x08)
    8124                    
    8125                    $C$DW$728       .dwtag  DW_TAG_member
    8126                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$6)
    8127                            .dwattr $C$DW$728, DW_AT_name("ActualNumOfUserFiles")
    8128                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    8129                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8130                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8131                            .dwattr $C$DW$728, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8132                            .dwattr $C$DW$728, DW_AT_decl_line(0xe8)
    8133                            .dwattr $C$DW$728, DW_AT_decl_column(0x08)
    8134                    
    8135                    $C$DW$729       .dwtag  DW_TAG_member
    8136                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$6)
    8137                            .dwattr $C$DW$729, DW_AT_name("ActualNumOfSysFiles")
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  149

    8138                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    8139                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8140                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8141                            .dwattr $C$DW$729, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8142                            .dwattr $C$DW$729, DW_AT_decl_line(0xe9)
    8143                            .dwattr $C$DW$729, DW_AT_decl_column(0x08)
    8144                    
    8145                    $C$DW$730       .dwtag  DW_TAG_member
    8146                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$6)
    8147                            .dwattr $C$DW$730, DW_AT_name("Padding")
    8148                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("Padding")
    8149                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8150                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8151                            .dwattr $C$DW$730, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8152                            .dwattr $C$DW$730, DW_AT_decl_line(0xea)
    8153                            .dwattr $C$DW$730, DW_AT_decl_column(0x08)
    8154                    
    8155                    $C$DW$731       .dwtag  DW_TAG_member
    8156                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$13)
    8157                            .dwattr $C$DW$731, DW_AT_name("NumOfAlerts")
    8158                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("NumOfAlerts")
    8159                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8160                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8161                            .dwattr $C$DW$731, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8162                            .dwattr $C$DW$731, DW_AT_decl_line(0xeb)
    8163                            .dwattr $C$DW$731, DW_AT_decl_column(0x08)
    8164                    
    8165                    $C$DW$732       .dwtag  DW_TAG_member
    8166                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$13)
    8167                            .dwattr $C$DW$732, DW_AT_name("NumOfAlertsThreshold")
    8168                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    8169                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8170                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8171                            .dwattr $C$DW$732, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8172                            .dwattr $C$DW$732, DW_AT_decl_line(0xec)
    8173                            .dwattr $C$DW$732, DW_AT_decl_column(0x08)
    8174                    
    8175                    $C$DW$733       .dwtag  DW_TAG_member
    8176                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$9)
    8177                            .dwattr $C$DW$733, DW_AT_name("FATWriteCounter")
    8178                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("FATWriteCounter")
    8179                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8180                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8181                            .dwattr $C$DW$733, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8182                            .dwattr $C$DW$733, DW_AT_decl_line(0xed)
    8183                            .dwattr $C$DW$733, DW_AT_decl_column(0x08)
    8184                    
    8185                    $C$DW$734       .dwtag  DW_TAG_member
    8186                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$9)
    8187                            .dwattr $C$DW$734, DW_AT_name("Padding2")
    8188                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("Padding2")
    8189                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8190                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8191                            .dwattr $C$DW$734, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8192                            .dwattr $C$DW$734, DW_AT_decl_line(0xee)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  150

    8193                            .dwattr $C$DW$734, DW_AT_decl_column(0x08)
    8194                    
    8195                            .dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    8196                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe2)
    8197                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    8198                            .dwendtag $C$DW$T$56
    8199                    
    8200                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    8201                            .dwattr $C$DW$T$58, DW_AT_name("SlFsControlFilesUsage_t")
    8202                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$56)
    8203                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    8204                            .dwattr $C$DW$T$58, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    8205                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xef)
    8206                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x02)
    8207                    
    8208                    
    8209                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    8210                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x24)
    8211                    $C$DW$735       .dwtag  DW_TAG_member
    8212                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$57)
    8213                            .dwattr $C$DW$735, DW_AT_name("DeviceUsage")
    8214                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("DeviceUsage")
    8215                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8216                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8217                            .dwattr $C$DW$735, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8218                            .dwattr $C$DW$735, DW_AT_decl_line(0xf4)
    8219                            .dwattr $C$DW$735, DW_AT_decl_column(0x1e)
    8220                    
    8221                    $C$DW$736       .dwtag  DW_TAG_member
    8222                            .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$58)
    8223                            .dwattr $C$DW$736, DW_AT_name("FilesUsage")
    8224                            .dwattr $C$DW$736, DW_AT_TI_symbol_name("FilesUsage")
    8225                            .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8226                            .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8227                            .dwattr $C$DW$736, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8228                            .dwattr $C$DW$736, DW_AT_decl_line(0xf5)
    8229                            .dwattr $C$DW$736, DW_AT_decl_column(0x1e)
    8230                    
    8231                            .dwattr $C$DW$T$59, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    8232                            .dwattr $C$DW$T$59, DW_AT_decl_line(0xf3)
    8233                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    8234                            .dwendtag $C$DW$T$59
    8235                    
    8236                    $C$DW$T$578     .dwtag  DW_TAG_typedef
    8237                            .dwattr $C$DW$T$578, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
    8238                            .dwattr $C$DW$T$578, DW_AT_type(*$C$DW$T$59)
    8239                            .dwattr $C$DW$T$578, DW_AT_language(DW_LANG_C)
    8240                            .dwattr $C$DW$T$578, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    8241                            .dwattr $C$DW$T$578, DW_AT_decl_line(0xf6)
    8242                            .dwattr $C$DW$T$578, DW_AT_decl_column(0x03)
    8243                    
    8244                    
    8245                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    8246                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x0c)
    8247                    $C$DW$737       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  151

    8248                            .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$13)
    8249                            .dwattr $C$DW$737, DW_AT_name("IncludeFilters")
    8250                            .dwattr $C$DW$737, DW_AT_TI_symbol_name("IncludeFilters")
    8251                            .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8252                            .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8253                            .dwattr $C$DW$737, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8254                            .dwattr $C$DW$737, DW_AT_decl_line(0xfa)
    8255                            .dwattr $C$DW$737, DW_AT_decl_column(0x0b)
    8256                    
    8257                    $C$DW$738       .dwtag  DW_TAG_member
    8258                            .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$6)
    8259                            .dwattr $C$DW$738, DW_AT_name("OpenedForWriteCnt")
    8260                            .dwattr $C$DW$738, DW_AT_TI_symbol_name("OpenedForWriteCnt")
    8261                            .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8262                            .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8263                            .dwattr $C$DW$738, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8264                            .dwattr $C$DW$738, DW_AT_decl_line(0xfb)
    8265                            .dwattr $C$DW$738, DW_AT_decl_column(0x0b)
    8266                    
    8267                    $C$DW$739       .dwtag  DW_TAG_member
    8268                            .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$6)
    8269                            .dwattr $C$DW$739, DW_AT_name("OpeneForReadCnt")
    8270                            .dwattr $C$DW$739, DW_AT_TI_symbol_name("OpeneForReadCnt")
    8271                            .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8272                            .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8273                            .dwattr $C$DW$739, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8274                            .dwattr $C$DW$739, DW_AT_decl_line(0xfc)
    8275                            .dwattr $C$DW$739, DW_AT_decl_column(0x0b)
    8276                    
    8277                    $C$DW$740       .dwtag  DW_TAG_member
    8278                            .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$6)
    8279                            .dwattr $C$DW$740, DW_AT_name("ClosedFilesCnt")
    8280                            .dwattr $C$DW$740, DW_AT_TI_symbol_name("ClosedFilesCnt")
    8281                            .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8282                            .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8283                            .dwattr $C$DW$740, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8284                            .dwattr $C$DW$740, DW_AT_decl_line(0xfd)
    8285                            .dwattr $C$DW$740, DW_AT_decl_column(0x0b)
    8286                    
    8287                    $C$DW$741       .dwtag  DW_TAG_member
    8288                            .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$6)
    8289                            .dwattr $C$DW$741, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
    8290                            .dwattr $C$DW$741, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
    8291                            .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8292                            .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8293                            .dwattr $C$DW$741, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8294                            .dwattr $C$DW$741, DW_AT_decl_line(0xfe)
    8295                            .dwattr $C$DW$741, DW_AT_decl_column(0x0b)
    8296                    
    8297                    $C$DW$742       .dwtag  DW_TAG_member
    8298                            .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$6)
    8299                            .dwattr $C$DW$742, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
    8300                            .dwattr $C$DW$742, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
    8301                            .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8302                            .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  152

    8303                            .dwattr $C$DW$742, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8304                            .dwattr $C$DW$742, DW_AT_decl_line(0xff)
    8305                            .dwattr $C$DW$742, DW_AT_decl_column(0x0b)
    8306                    
    8307                    $C$DW$743       .dwtag  DW_TAG_member
    8308                            .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$6)
    8309                            .dwattr $C$DW$743, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
    8310                            .dwattr $C$DW$743, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
    8311                            .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8312                            .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8313                            .dwattr $C$DW$743, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8314                            .dwattr $C$DW$743, DW_AT_decl_line(0x100)
    8315                            .dwattr $C$DW$743, DW_AT_decl_column(0x0b)
    8316                    
    8317                    $C$DW$744       .dwtag  DW_TAG_member
    8318                            .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$54)
    8319                            .dwattr $C$DW$744, DW_AT_name("padding")
    8320                            .dwattr $C$DW$744, DW_AT_TI_symbol_name("padding")
    8321                            .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8322                            .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8323                            .dwattr $C$DW$744, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8324                            .dwattr $C$DW$744, DW_AT_decl_line(0x101)
    8325                            .dwattr $C$DW$744, DW_AT_decl_column(0x0b)
    8326                    
    8327                            .dwattr $C$DW$T$60, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
    8328                            .dwattr $C$DW$T$60, DW_AT_decl_line(0xf9)
    8329                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    8330                            .dwendtag $C$DW$T$60
    8331                    
    8332                    $C$DW$T$579     .dwtag  DW_TAG_typedef
    8333                            .dwattr $C$DW$T$579, DW_AT_name("SlFsControlGetCountersResponse_t")
    8334                            .dwattr $C$DW$T$579, DW_AT_type(*$C$DW$T$60)
    8335                            .dwattr $C$DW$T$579, DW_AT_language(DW_LANG_C)
    8336                            .dwattr $C$DW$T$579, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/w
    8337                            .dwattr $C$DW$T$579, DW_AT_decl_line(0x102)
    8338                            .dwattr $C$DW$T$579, DW_AT_decl_column(0x03)
    8339                    
    8340                    
    8341                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    8342                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x0c)
    8343                    $C$DW$745       .dwtag  DW_TAG_member
    8344                            .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$13)
    8345                            .dwattr $C$DW$745, DW_AT_name("FileMaxSize")
    8346                            .dwattr $C$DW$745, DW_AT_TI_symbol_name("FileMaxSize")
    8347                            .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8348                            .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8349                            .dwattr $C$DW$745, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8350                            .dwattr $C$DW$745, DW_AT_decl_line(0x111)
    8351                            .dwattr $C$DW$745, DW_AT_decl_column(0x0a)
    8352                    
    8353                    $C$DW$746       .dwtag  DW_TAG_member
    8354                            .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$13)
    8355                            .dwattr $C$DW$746, DW_AT_name("Properties")
    8356                            .dwattr $C$DW$746, DW_AT_TI_symbol_name("Properties")
    8357                            .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler Unix v20.2.0 Thu Mar 19 13:13:13 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  153

    8358                            .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8359                            .dwattr $C$DW$746, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8360                            .dwattr $C$DW$746, DW_AT_decl_line(0x112)
    8361                            .dwattr $C$DW$746, DW_AT_decl_column(0x0a)
    8362                    
    8363                    $C$DW$747       .dwtag  DW_TAG_member
    8364                            .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$13)
    8365                            .dwattr $C$DW$747, DW_AT_name("FileAllocatedBlocks")
    8366                            .dwattr $C$DW$747, DW_AT_TI_symbol_name("FileAllocatedBlocks")
    8367                            .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8368                            .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8369                            .dwattr $C$DW$747, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wif
    8370                            .dwattr $C$DW$747, DW_AT_decl_line(0x113)
    8371                            .dwattr $C$DW$747, DW_AT_decl_column(0x0a)
    8372                    
    8373                            .dwattr $C$DW$T$61, DW_AT_decl_file("/vagrant/Q1_eng_19.3.20/sdk_root/source/ti/drivers/net/wi
